In [1]:
import numpy as np
import pandas as pd
# Safe settings for Pandas.
pd.set_option('mode.chained_assignment', 'raise')
%matplotlib inline
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

In [6]:
titanic = pd.read_csv("titanic_stlearn.csv")
# Boolean with True for passengers with not-NA sibsp values, False otherwise.
have_sibsp = titanic['sibsp'].notna()
# Select rows with value (not-NA) sibsp values.
with_sibsp = titanic[have_sibsp]
with_sibsp.head()

,name,gender,age,class,embarked,country,ticketno,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,Southampton,United States,5547.0,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,Southampton,United States,2673.0,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,Southampton,United States,2673.0,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,Southampton,England,2673.0,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,Southampton,Norway,348125.0,7.13,0.0,0.0,yes

In [8]:
#lets see how many survived
titanic['survived'].value_counts()

no     1496
yes     711
Name: survived, dtype: int64

In [9]:
#lets get the passager class frequency
titanic['class'].value_counts()

3rd                 709
victualling crew    431
1st                 324
engineering crew    324
2nd                 284
restaurant staff     69
deck crew            66
Name: class, dtype: int64

In [10]:
titanic['gender'].value_counts()

male      1718
female     489
Name: gender, dtype: int64

In [17]:
#lets see how gender affected the survival rate
with_sibsp.groupby(['class']).mean()

             age       ticketno       fare     sibsp     parch
class
1st    39.163323   47309.959877  89.017344  0.435185  0.364198
2nd    29.985507  118257.166667  21.503081  0.394928  0.369565
3rd    25.066785  457953.079320  12.927864  0.570014  0.401697

In [18]:
#How number of sibblings('SibSp') affects the survival of a passenger ?
titanic['sibsp'].value_counts()

0.0    889
1.0    319
2.0     42
4.0     22
3.0     20
8.0      9
5.0      6
Name: sibsp, dtype: int64

In [28]:
titanic['parch'].value_counts()

0.0    1000
1.0     170
2.0     113
3.0       8
5.0       6
4.0       6
6.0       2
9.0       2
Name: parch, dtype: int64

In [36]:
with_sibsp.groupby(['survived']).mean()
#the mean sibsp is high where the passager did not survive meaning it was a factor
#

                age       ticketno       fare     sibsp     parch
survived
no        30.096791  335343.565056  23.305209  0.522924  0.329616
yes       28.818167  201723.490982  49.486979  0.462000  0.476000

In [42]:
#this is the mean sibsp of women in 3rd class that survived and those that did not
#the sibsp of those who did not survive is high thus proving that
#the number of relative and children on board affected the reluctance for the spouse to leave the ship
titanic[titanic['gender'].isin(['female']) & titanic['class'].isin(['3rd'])].groupby(['survived']).mean()

                age       ticketno       fare     sibsp     parch
survived
no        24.618182  431441.690909  17.925605  1.109091  0.972727
yes       21.980346  421756.141509  11.741875  0.462264  0.481132